---
kind: method
id: M:Autodesk.Revit.DB.Mechanical.ZoneElementDomainData.Dispose
source: html/0d957f82-66da-1ecb-c9e3-7269268f3a2d.htm
---
# Autodesk.Revit.DB.Mechanical.ZoneElementDomainData.Dispose Method

Releases all resources used by the ZoneElementDomainData

## Syntax (C#)
```csharp
public void Dispose()
```